#pragma once
#include "UnitTest.h"
#include <cassert>
class Tests
{
	DrugInfo Etalon(double percent, double dose, const wstring& ED)
	{
		DrugInfo d;
		d.percent = percent;
		d.dose = dose;
		d.ED = ED;
		return d;
	}
public:
	void Execute()
	{
		//растворы
		
		test1();
		test2();
		test3();
		test4();
		test5();

		//Сухие вещества
		
		test6();
		test7();
		test8();
		test9();
		test10();
		test11();
		
		test12();
		test13();
		test14();
		
	}
	//---------------------------------------------------------------------
	void test1()
	{
		assert(UnitTest(
			Etalon(1, 1, L"мл"),
			{
				L"10mg/ ml",
				L"10mg/ 1ml",
				L"10mg/1ml",
				L"10mg/ml",
				L"10 mg/ml",
				L"10mg /ml",
				L"1% 1 ml",
				L"раст.1% 1 ml"
			})());
	}
	//---------------------------------------------------------------------
	void test2()
	{
		assert(UnitTest(
			Etalon(0.08, 5, L"мл"),
			{
				L"пор. 4мг+р-ль 5мл №1",
				L"0.08% 5мл №1",
				L"5мл 4мг №1"
			})());
	}
	//---------------------------------------------------------------------
	void test3()// БЕРОДУАЛ
	{
		assert(UnitTest(
			Etalon(0, 20, L"мл"),
			{
				L"р-р д/инг. 0,25мг+0,5мг/мл 20мл", 
				L"0мг 20мл",
				L"20мл"
			})());
	}
	//---------------------------------------------------------------------
	void test4()//ГИДРОКОРТИЗОН
	{
		assert(UnitTest(
			Etalon(2.5, 5, L"мл"),
			{
				L"сусп. д/ин. 125мг/5мл №1",
				L"125 мг 5 мл",
				L"125 мг/5 мл 5 мл"
			})());
	}
	//---------------------------------------------------------------------
	void test5()//ГЕПАРИН
	{// может потребоваться пересчет сколько тысЕД в час
		//ОКСИТОЦИН *  амп. 5ЕД 1мл №5
		//ГЕПАРИН  ** фл. 5тЕД / мл 5мл №5
		//ГЕПАРИН - натрий 5тМЕ / мл 5мл №10
		//р-р для в/в и п/к введ. 30млн ЕД/мл 1 мл №5
		//ГОРДОКС  амп. 100тЕД 10мл №25
		assert(UnitTest(
			Etalon(0, 5, L"мл"),
			{
				L"** фл. 5тЕД/мл 5мл №5",
				L"фл. 5тЕД / мл 5мл",
				L"5тМЕ / мл 5мл №10",
				L"р-р для в/в и п/к введ. 30млн ЕД/мл 5 мл №5",
				L"амп. 100тЕД 5мл №25"
			})());
	}
	//---------------------------------------------------------------------
	void test6()//АЛЛАПИНИН
	{
		assert(UnitTest(
			Etalon(0, 25, L"мг"),
			{
				L"таб.  25мг №30"
			})());
	}
	//---------------------------------------------------------------------
	void test7()//L-тироксин
	{
		assert(UnitTest(
			Etalon(0, 50, L"мкг"),
			{
				L"таб.  50мкг"
			})());
	}
	//---------------------------------------------------------------------
	void test8()//АКСЕТИН
	{
		assert(UnitTest(
			Etalon(0, 1.5, L"г"),
			{
				L"пор. д/ин. фл. 1,5г №100"
			})());
	}
	//---------------------------------------------------------------------
	void test9()//СИМБИКОРТ ТУРБУХАЛЕР
	{
		//ParserDrugFrom d4(4, L"СИМБИКОРТ ТУРБУХАЛЕР", L"160+4,5мкг/120доз");
		assert(UnitTest(
			Etalon(0, 120, L"доз"),
			{
				L"160+4,5мкг/120доз"
			})());
	}
	//---------------------------------------------------------------------
	void test10() // тест на таблетированные формы
	{
		//БИСАКОДИЛ
		assert(UnitTest(
			Etalon(0, 5, L"мг"),
			{
				L"**  таб. п/обол. 5мг №40"	
				L"таб. п/обол. 0.005 ** №40",
				L"таб. п/обол. 0.005"
			})());
	
		//БИСАКОДИЛ **  таб. п/обол. 5мг №40
	}
	//---------------------------------------------------------------------
	void test11() // тест на комбинированные препараты в таблетированной форме
	{
		assert(UnitTest(
			Etalon(0, 1, L"таб."),
			{
				L"тб. 30мг + 10мг № 30",
				L"тб. 30мг+10мг № 30"
				L"тб. 30+10мг № 30",
				L"тб. 30 + 10мг № 30",
				L"0,16/0,0125 № 28 тб"
			})());
		//тб. 30мг+10мг № 30
		//**  таб. п/обол. 5мг №40
		//тб п/о 50+12,5мг №30
	}
	//---------------------------------------------------------------------
	void test12()
	{
		assert(UnitTest(
			Etalon(0, 1, L"флак."),
			{
				L"пор.д/ин. фл.в/в  1г+1г №1"
				//,L"пор.д/ин. фл.в/в и в/м 1г+1г №1"
			})());
		//пор.д/ин. фл.в/в и в/м 1г+1г №1 - "фл." ед измерения
	}
	//---------------------------------------------------------------------
	void test13()//комбинированные препараты
	{
		// ед измерения гр
		//БЕПАНТЕН  крем 5 % 100,0
		//БЕПАНТЕН  крем 5 % -30гр.
		assert(UnitTest(
			Etalon(0, 100, L"г"),
			{
				L"крем 5 % 100,0"
			})());
		
	}
	//---------------------------------------------------------------------
	void test14()
	{
		//БИСАКОДИЛ **  св. №10
		//БИСАКОДИЛ **  супп.рект. 10мг №10
		assert(UnitTest(
			Etalon(0, 1, L"супп.рект."),
			{
				L"**  св. №10",
				L"**  супп.рект. 10мг №10"
			})());
	}
	//---------------------------------------------------------------------
	


};
