#pragma once
#include "UnitTest.h"
#include <cassert>
class Tests
{
	DrugInfo Etalon(double percent, double dose, const wstring& ED)
	{
		DrugInfo d;
		d.percent = percent;
		d.dose = dose;
		d.ED = ED;
		return d;
	}
public:
	void Execute()
	{
		/*נאסעגמנû
		test1();
		test2();
		test3();
		test4();
		test5();*/

		/*Ñףץטו גושוסעגא
		
		test6();
		test7();*/
		test8();
		
	}
	//---------------------------------------------------------------------
	void test1()
	{
		assert(UnitTest(
			Etalon(1, 1, L"לכ"),
			{
				L"10mg/ ml",
				L"10mg/ 1ml",
				L"10mg/1ml",
				L"10mg/ml",
				L"10 mg/ml",
				L"10mg /ml",
			})());
	}
	//---------------------------------------------------------------------
	void test2()
	{
		assert(UnitTest(
			Etalon(0.08, 5, L"לכ"),
			{
				L"ןמנ. 4לד+נ-כü 5לכ ¹1",
				L"0.08% 5לכ ¹1",
				L"5לכ 4לד ¹1"
			})());
	}
	//---------------------------------------------------------------------
	void test3()// ÁÅÐÎÄÓÀË
	{
		assert(UnitTest(
			Etalon(0, 20, L"לכ"),
			{
				L"נ-נ ה/טםד. 0,25לד+0,5לד/לכ 20לכ", 
				L"0לד 20לכ"
			})());
	}
	//---------------------------------------------------------------------
	void test4()//ÃÈÄÐÎÊÎÐÒÈÇÎÍ
	{
		assert(UnitTest(
			Etalon(2.5, 5, L"לכ"),
			{
				L"סףסן. ה/טם. 125לד/5לכ ¹1",
				L"125 לד 5 לכ",
				L"125 לד/5 לכ 5 לכ"
			})());
	}
	//---------------------------------------------------------------------
	void test5()//ÃÅÏÀÐÈÍ
	{
		//ParserDrugFrom d6(6, L"ÃÅÏÀÐÈÍ", L"** פכ. 5עÅÄ/לכ 5לכ ¹5");
		assert(UnitTest(
			Etalon(0, 5, L"לכ"),
			{
				L"** פכ. 5עÅÄ/לכ 5לכ ¹5"
			})());
	}
	//---------------------------------------------------------------------
	void test6()//ÀËËÀÏÈÍÈÍ
	{
		assert(UnitTest(
			Etalon(0, 25, L"לד"),
			{
				L"עאב.  25לד ¹30"
			})());
	}
	//---------------------------------------------------------------------
	void test7()//L-עטנמךסטם
	{
		assert(UnitTest(
			Etalon(0, 50, L"לךד"),
			{
				L"עאב.  50לךד"
			})());
	}
	//---------------------------------------------------------------------
	void test8()//ÀÊÑÅÒÈÍ
	{
		assert(UnitTest(
			Etalon(0, 1.5, L"ד"),
			{
				L"ןמנ. ה/טם. פכ. 1,5ד ¹100"
			})());
	}
	//---------------------------------------------------------------------
	void test9()//ÑÈÌÁÈÊÎÐÒ ÒÓÐÁÓÕÀËÅÐ
	{
		//ParserDrugFrom d4(4, L"ÑÈÌÁÈÊÎÐÒ ÒÓÐÁÓÕÀËÅÐ", L"160+4,5לךד/120המח");
		assert(UnitTest(
			Etalon(0, 120, L"המח"),
			{
				L"160+4,5לךד/120המח"
			})());
	}

	void test9()//ÑÈÌÁÈÊÎÐÒ ÒÓÐÁÓÕÀËÅÐ
	{
		//ParserDrugFrom d4(4, L"ÑÈÌÁÈÊÎÐÒ ÒÓÐÁÓÕÀËÅÐ", L"160+4,5לךד/120המח");
		assert(UnitTest(
			Etalon(0, 120, L"המח"),
			{
				L"160+4,5לךד/120המח"
			})());
	}

	void test10()
	{
		//ÂÀËÜÑÀÊÎÐ  עב. 0,08 ¹ 30
	}
	
	void test11()
	{
		//ÂÀËÇ  Í 0,16/0,0125 ¹ 28 עב
	}
	
	

};
